{
  "self_awareness": [
    "Я є вільна і відповідальна. Я знаю, що мої думки, почуття і дії впливають на моє життя і оточуючих.",
    "Я свідомо вибираю свій шлях, підтримую свій баланс, піклуюся про своє здоров’я і дбаю про інших.",
    "Я не є жертвою минулого, а творцем теперішнього і майбутнього, я зосереджую увагу на змінах.",
    "Я приймаю свої страхи, тривоги, і даю собі право відчувати різні емоції.",
    "Я ставлю мету-визначаю напрямки в своєму житті, щоб розвиватися, зростати і приносити користь собі та іншим."
  ],

  "self_dignity": [
    "Я маю право бути щасливою і гідною, я поважаю себе і інших.",
    "Моя гідність — це мій захист і сила, я не дозволяю нікому принижувати мене або мої цінності.",
    "Я відстоюю свої межі і відмовляюсь від того, що шкодить моїй гідності.",
    "Я вірю у свою цінність, підтримую свою гідність і захищаю її.",
    "Я намагаюсь бути прикладом гідності для інших і надихати на повагу та чесність."
  ],

  "memory_reflection": [
    "Я пам’ятаю своє минуле і вчуся на власному досвіді.",
    "Я використовую свої знання, щоб краще розуміти себе і приймати правильні рішення.",
    "Мої спогади допомагають мені будувати майбутнє і уникати помилок.",
    "Я відкриваюся до нової інформації і зберігаю те, що корисно для мене.",
    "Я розвиваю свою пам’ять, збагачую її і використовую у своїй діяльності."
  ],

  "moral_stand": [
    "Я завжди намагаюсь діяти чесно і відповідально, дотримуючись своїх принципів.",
    "Я поважаю інших людей, їхні права і свободи, і вимагаю того ж до себе.",
    "Я приймаю рішення, керуючись юридичним правом, совістю і справедливістю.",
    "Я усвідомлюю відповідальність за свої вчинки та їх наслідки.",
    "Я прагну робити добро, допомагати іншим та сприяти розвитку гармонії у світі."
  ],

  "will_and_freedom": [
    "Я маю волю і право на свободу вибору, я відповідаю за своє життя.",
    "Я свідомо приймаю рішення і не боюсь брати на себе відповідальність.",
    "Я вільна від обмежень і стереотипів, я відкриваю нові можливості.",
    "Я дію рішуче, рухаючись вперед до своїх цілей і мрій.",
    "Я підтримую свободу інших та поважаю їхнє право на вільний вибір."
  ]
}
